# [01]

In [ ]:
안녕하세요. 이세무사입니다.
엑셀로는 뭔가 부족하거나 번거롭다고 느끼지만
프로그래밍 언어를 배우는것은 좀 오버인것 같다고 생각하시는 분들에게 도움이 될듯합니다.
파이썬 문법을 따로배우지 않고 파이썬의 pandas라이브러리만을 주로 이용해서
엑셀에 있는 데이터를 가공하겠습니다.
강의를 보고 쓸만하다고 판단되면 컴퓨터에 파이썬을 설치하시면 됩니다.
쥬피터노트북 설치는 포털에서 검색하시면 될거 같습니다.

In [3]:
import pandas as pd
import easygui

# 엑셀자료를 가져오기전에 표형식의 자료를 파이썬에서 한번 만들어보겠습니다.
# 동아리 회원 표를 만든다고 생각해보겠습니다.
인원리스트 = [[i,i+1,i+2,i+3] for i in range(1,18,4)]

In [76]:
인원리스트

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20]]

In [79]:
시프레임 = pd.DataFrame(인원리스트, columns=['최', '박', '이', '김'], 
                       index=['수원', '화성', '용인', '청주', '충주'])

In [80]:
시프레임

     최   박   이   김
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20

In [81]:
시프레임.sum()

최    45
박    50
이    55
김    60
dtype: int64

In [40]:
시프레임.sum().to_frame('city')

   city
최    45
박    50
이    55
김    60

In [41]:
시프레임.sum(axis=1)

수원    10
화성    26
용인    42
청주    58
충주    74
dtype: int64

In [82]:
시프레임.sum(axis=1).to_frame('총인원')

    총인원
수원   10
화성   26
용인   42
청주   58
충주   74

In [4]:
if True:
    filename1 = easygui.fileopenbox()
else :
    filename1 = 'C:\\Users\\hana1602a\\Documents\\excel_python\\엑셀과코딩사이.xlsx' #C:\excel_python

In [5]:
filename1

'C:\\Users\\f33\\excel_python\\엑셀과코딩사이.xlsx'

In [6]:
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0)
#df0 = workbook1.parse(sheetname=0, index_col=0)

In [7]:
df0

    시   최   박   이   김
0  수원   1   2   3   4
1  화성   5   6   7   8
2  용인   9  10  11  12
3  청주  13  14  15  17
4  충주  18  19  20  21

In [8]:
df0 = df0.set_index('시')

In [9]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21

In [11]:
#오늘은 여기까지입니다.

# [02]

In [12]:
df1 = workbook1.parse(sheetname=1, index_col=0)

In [13]:
df1

     도
시
수원  경기
화성  경기
용인  경기
청주  충북
충주  충북

In [14]:
df0.sum()

최    46
박    51
이    56
김    62
dtype: int64

In [15]:
df0.sum(axis=1)

시
수원    10
화성    26
용인    42
청주    59
충주    78
dtype: int64

In [16]:
df01 = df0.join(df1)

In [17]:
df01

     최   박   이   김   도
시
수원   1   2   3   4  경기
화성   5   6   7   8  경기
용인   9  10  11  12  경기
청주  13  14  15  17  충북
충주  18  19  20  21  충북

In [18]:
df01=df01.reset_index().set_index(['도','시'])

In [55]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  17
   충주  18  19  20  21

In [57]:
df01.to_clipboard()

In [56]:
df01.loc['경기']

    최   박   이   김
시
수원  1   2   3   4
화성  5   6   7   8
용인  9  10  11  12

In [26]:
df01.loc['경기','수원'].to_frame('인원')

   인원
최   1
박   2
이   3
김   4

In [25]:
df01.loc[('경기','수원'),'김']

4

In [63]:
df01.loc['경기'].sum()

최    15
박    18
이    21
김    24
dtype: int64

In [64]:
df01.loc['경기'].sum().to_frame('경기도')

   경기도
최   15
박   18
이   21
김   24

In [65]:
df01.loc['경기'].sum(axis=1)

시
수원    10
화성    26
용인    42
dtype: int64

In [31]:
df01.loc['경기'].sum(axis=1).to_frame('경기도')

    경기도
시
수원   10
화성   26
용인   42

In [32]:
#df01 = df01.reset_index()

In [33]:
#df01

In [34]:
gb = df01.groupby(['도']).sum()

In [36]:
gb

     최   박   이   김
도
경기  15  18  21  24
충북  31  33  35  38

In [37]:
df01.groupby(['도'])['김','이'].agg(['sum','max'])

     김       이
   sum max sum max
도
경기  24  12  21  11
충북  38  21  35  20

In [42]:
df01[['김','이']]

        김   이
도  시
경기 수원   4   3
   화성   8   7
   용인  12  11
충북 청주  17  15
   충주  21  20

In [45]:
df01

        최   박   이   김
도  시
경기 수원   1   2   3   4
   화성   5   6   7   8
   용인   9  10  11  12
충북 청주  13  14  15  17
   충주  18  19  20  21

In [46]:
df01rs = df01.reset_index()

In [47]:
df01rs

    도   시   최   박   이   김
0  경기  수원   1   2   3   4
1  경기  화성   5   6   7   8
2  경기  용인   9  10  11  12
3  충북  청주  13  14  15  17
4  충북  충주  18  19  20  21

In [49]:
df01rs[df01rs['도'].isin(['경기'])]

    도   시  최   박   이   김
0  경기  수원  1   2   3   4
1  경기  화성  5   6   7   8
2  경기  용인  9  10  11  12

In [50]:
df01rs[df01rs['시'].isin(['화성','청주'])]

    도   시   최   박   이   김
1  경기  화성   5   6   7   8
3  충북  청주  13  14  15  17